ERP.belugaerp/src/Documents/битОтражениеФактаПоПриходномуОрдеру/битОтражениеФактаПоПриходномуОрдеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битОтражениеФактаПоПриходномуОрдеру</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_СоставУпаковок</registerRecords>
  <registerRecords>AccumulationRegister.бг_ПоказателиРаботыОператоровWMS</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>ПриходныйОрдерНаТовары</name>
    <type>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнешнейСкладскойСистемы</name>
    <type>
      <types>EnumRef.бг_ТипыВнешнихСкладскихСистем</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьАлкогольнаяПродукция</name>
    <comment>// Признак что требуется ТТН</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьМаркируемаяАлкогольнаяПродукция</name>
    <comment>// Признак что требуются марки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПриемки</name>
    <type>
      <types>EnumRef.бг_РезультатыПриемкиWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ОператорТСД</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусSolvo</name>
    <type>
      <types>EnumRef.бг_СтатусыПриемкиSolvo</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодРодитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Упаковки</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодРодитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/InformationRegisters/бг_ДокументыИнтеграцииСоСкладскимиСистемами/бг_ДокументыИнтеграцииСоСкладскимиСистемами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ДокументыИнтеграцииСоСкладскимиСистемами</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыДокументовИнтеграцииСоСкладскимиСистемами</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.битОтражениеФактаПоПриходномуОрдеру</types>
      <types>DocumentRef.битПереупаковка</types>
      <types>DocumentRef.битИнвентаризацияПродукцииЕГАИС</types>
      <types>DocumentRef.битОтражениеФактаПоРасходномуОрдеру</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_РезультатыПриемкиWMS/бг_РезультатыПриемкиWMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_РезультатыПриемкиWMS</name>
  <enumValues>
    <name>ПолноеСоответствиеПлану</name>
  </enumValues>
  <enumValues>
    <name>ЕстьРасхожденияОтПлана</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтменена</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ТипыВнешнихСкладскихСистем/бг_ТипыВнешнихСкладскихСистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ТипыВнешнихСкладскихСистем</name>
  <enumValues>
    <name>MobileSmarts</name>
  </enumValues>
  <enumValues>
    <name>Solvo</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_СтатусыПриемкиSolvo/бг_СтатусыПриемкиSolvo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СтатусыПриемкиSolvo</name>
  <enumValues>
    <name>КПоступлению</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Согласование</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ВариантыОтложеннойОбработкиОбъектов/бг_ВариантыОтложеннойОбработкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ВариантыОтложеннойОбработкиОбъектов</name>
  <enumValues>
    <name>АвтоСогласованиеЗаказовКлиентов</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьОбеспечениеЗаказовКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ИзменитьДатуСвязанныхУчетныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьАкцизныеМарки</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьДокументыWMS</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьНовуюОрганизациюЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьПрисоединенныйФайлПисьма</name>
  </enumValues>
  <enumValues>
    <name>ОтправитьЗапросыСправки1ЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ОтразитьДополнительныеСведенияЗаказаКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПередатьЗаказыКлиентовНаСборку</name>
  </enumValues>
  <enumValues>
    <name>ПерезаполнитьЗаявкиНаРасходованиеДС</name>
    <comment>Проект &quot;Магистраль&quot;</comment>
  </enumValues>
  <enumValues>
    <name>РассчитатьПоказателиРаботыОператоровWMS</name>
  </enumValues>
  <enumValues>
    <name>СоздатьИзменитьПодчиненнуюРеализацию</name>
  </enumValues>
  <enumValues>
    <name>СоздатьЗаказМагазина</name>
  </enumValues>
  <enumValues>
    <name>СоздатьНоменклатуруПартнера</name>
  </enumValues>
  <enumValues>
    <name>СформироватьДокументы</name>
  </enumValues>
  <enumValues>
    <name>СформироватьЗаказыКлиентов</name>
  </enumValues>
  <enumValues>
    <name>СформироватьИнтернетЗаказыКлиентов</name>
  </enumValues>
  <enumValues>
    <name>СформироватьРейсы</name>
  </enumValues>
  <enumValues>
    <name>СформироватьДвиженияМарок</name>
  </enumValues>
  <enumValues>
    <name>СформироватьОрдераНаОтражениеПересортицы</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьРезервыПриПоступленииТовара</name>
  </enumValues>
  <enumValues>
    <name>СформироватьПриходныйОрдерНаТовары</name>
  </enumValues>
  <enumValues>
    <name>СформироватьРасходныйОрдерНаТовары</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_СтатусыДокументовИнтеграцииСоСкладскимиСистемами/бг_СтатусыДокументовИнтеграцииСоСкладскимиСистемами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СтатусыДокументовИнтеграцииСоСкладскимиСистемами</name>
  <enumValues>
    <name>ЗагруженБезОбработки</name>
  </enumValues>
  <enumValues>
    <name>ЗагруженИОбработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_ЕстьАлкогольнаяПродукция</name>
    <comment>// Признак что требуется ТТН</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕстьМаркируемаяАлкогольнаяПродукция</name>
    <comment>// Признак что требуются марки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НеАктуализироватьЗаказыКлиентовПоРезервам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_РазрешитьПараллельнуюСборку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипПриемки</name>
    <type>
      <types>CatalogRef.битТипыПриемкиWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/битОтражениеФактаПоПриходномуОрдеру/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

&После("ОбработкаПолученияПолейПредставления")
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("РезультатПриемки");
	
КонецПроцедуры

&После("ОбработкаПолученияПредставления")
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Данные.РезультатПриемки = Перечисления.бг_РезультатыПриемкиWMS.ПриемкаОтменена Тогда
		Представление = СтрШаблон(
			НСтр("ru='Отражение факта по приходному ордеру №%1 от %2 (отменен)'"),
			Данные.Номер,
			Данные.Дата);
	Иначе
		Представление = СтрШаблон(
			НСтр("ru='Отражение факта по приходному ордеру №%1 от %2'"),
			Данные.Номер,
			Данные.Дата);
	КонецЕсли;
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Отчеты.бг_ДвижениеМарок.ДобавитьКомандуДвижениеМарокПоДокументу(КомандыОтчетов);
	
КонецПроцедуры

// Возвращает организацию по документу.
//
// Параметры:
//  ОтражениеФактаПоПриходномуОрдеру - ДокументСсылка.битОтражениеФактаПоПриходномуОрдеру
//  ПриходныйОрдерНаТовары - ДокументСсылка.ПриходныйОрдерНаТовары
//
// Возвращаемое значение:
//   СправочникСсылка.Организации
//
Функция ОрганизацияДокумента(ОтражениеФактаПоПриходномуОрдеру = Неопределено, ПриходныйОрдерНаТовары = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ПриходныйОрдерНаТовары) Тогда
		
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ПриходныйОрдерНаТовары,
			"Распоряжение.Организация");
		
	Иначе
		
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ОтражениеФактаПоПриходномуОрдеру,
			"ПриходныйОрдерНаТовары.Распоряжение.Организация");
		
	КонецЕсли;
	
	Возврат Организация;
	
КонецФункции

// Возвращает организацию ЕГАИС документа.
//
// Параметры:
//  ОтражениеФактаПоПриходномуОрдеру - ДокументСсылка.битОтражениеФактаПоПриходномуОрдеру
//  
// Возвращаемое значение:
//   СправочникСсылка.КлассификаторОрганизацийЕГАИС
//
Функция ОрганизацияЕГАИСДокумента(ОтражениеФактаПоПриходномуОрдеру) Экспорт
	// TODO рефакторинг BG-3199. Сделать один запрос для получения организации ЕГИАС
	ОрганизацияЕГАИС = Неопределено;
	
	Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ОтражениеФактаПоПриходномуОрдеру,
		"Склад");
	
	Если ЗначениеЗаполнено(Склад) Тогда
		ОрганизацияЕГАИС = Справочники.Склады.бг_ОрганизацияЕГАИС(Склад);
	КонецЕсли;
	
	Возврат ОрганизацияЕГАИС;
	
КонецФункции

// Возвращает признак необходимости проводить документ, опираясь на тип внешней складской системы и статус.
//
// Параметры:
//   ОтражениеФактаПоРасходномуОрдеру - ДокументСсылка.битОтражениеФактаПоПриходномуОрдеру
//  
// Возвращаемое значение:
//   Булево
//
Функция НеобходимоПроводитьДокумент(Документ) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.битОтражениеФактаПоПриходномуОрдеру") Тогда
		
		ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Документ,
			"ТипВнешнейСкладскойСистемы, ЕстьМаркируемаяАлкогольнаяПродукция, СтатусSolvo");
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.битОтражениеФактаПоПриходномуОрдеру") Тогда
		
		ДанныеДокумента = Новый Структура("ТипВнешнейСкладскойСистемы, ЕстьМаркируемаяАлкогольнаяПродукция, СтатусSolvo");
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, Документ);
		
	Иначе	
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента.ТипВнешнейСкладскойСистемы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоSolvo = ДанныеДокумента.ТипВнешнейСкладскойСистемы = Перечисления.бг_ТипыВнешнихСкладскихСистем.Solvo;
	
	Если ЭтоSolvo И Не ЗначениеЗаполнено(ДанныеДокумента.СтатусSolvo) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтатусSolvoУказаниеТоваровИМарок = СтатусSolvoУказаниеТоваровИМарок(ДанныеДокумента.ЕстьМаркируемаяАлкогольнаяПродукция);
	
	ЭтоСтатусSolvoСДаннымиТоваровИМарок = ДанныеДокумента.СтатусSolvo = СтатусSolvoУказаниеТоваровИМарок;

	Если ЭтоSolvo И ЭтоСтатусSolvoСДаннымиТоваровИМарок Или Не ЭтоSolvo Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#Область Solvo

// Возвращает список статусов Solvo, при которых документ в ERP полноценно заполнен и может быть принят к учету,
// предшествующие статусы являются информативными: отображают сведения о статусе сборки на стороне WMS.
//  
// Параметры:
//  ЕстьМаркируемаяАлкогольнаяПродукция - Булево - Признак наличия маркируемой алкогольной продукции в документе.
//  
// Возвращаемое значение:
//   Массив
//
Функция КонечныеСтатусыSolvo(ЕстьМаркируемаяАлкогольнаяПродукция) Экспорт

	КонечныеСтатусыSolvo = Новый Массив;
	
	Если ЕстьМаркируемаяАлкогольнаяПродукция Тогда
		КонечныеСтатусыSolvo.Добавить(Перечисления.бг_СтатусыПриемкиSolvo.Согласование);
		КонечныеСтатусыSolvo.Добавить(Перечисления.бг_СтатусыПриемкиSolvo.Принят);
	Иначе
		КонечныеСтатусыSolvo.Добавить(Перечисления.бг_СтатусыПриемкиSolvo.Принят);
	КонецЕсли;
	
	Возврат КонечныеСтатусыSolvo;

КонецФункции

// Возвращает список статусов Solvo, при которых документ в ERP уже полноценно заполнен и принят к учету,
// статусы являются информативными: отображают сведения о статусе завершения приемки на стороне WMS.
//  
// Параметры:
//  ЕстьМаркируемаяАлкогольнаяПродукция - Булево - Признак наличия маркируемой алкогольной продукции в документе.
//  
// Возвращаемое значение:
//   Массив
//
Функция КонечныеИнформативныеСтатусыSolvo(ЕстьМаркируемаяАлкогольнаяПродукция) Экспорт

	КонечныеИнформативныеСтатусы = Новый Массив;
	
	Если ЕстьМаркируемаяАлкогольнаяПродукция Тогда
		КонечныеИнформативныеСтатусы.Добавить(Перечисления.бг_СтатусыПриемкиSolvo.Принят);
	КонецЕсли;
	
	Возврат КонечныеИнформативныеСтатусы;

КонецФункции

// Статус Solvo, при котором WMS завершает сборку и присылает полноценное сообщение с заполненными табличными частями.
//                                                                          
// Параметры:
//  ЕстьМаркируемаяАлкогольнаяПродукция - Булево - Признак наличия маркируемой алкогольной продукции в документе.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.бг_СтатусыПриемкиSolvo
//
Функция СтатусSolvoУказаниеТоваровИМарок(ЕстьМаркируемаяАлкогольнаяПродукция) Экспорт
	
	Если ЕстьМаркируемаяАлкогольнаяПродукция Тогда
		Возврат Перечисления.бг_СтатусыПриемкиSolvo.Согласование;
	Иначе
		Возврат Перечисления.бг_СтатусыПриемкиSolvo.Принят;
	КонецЕсли;

КонецФункции

#КонецОбласти // Конец Solvo

#Область ОтложеннаяОбработка

Процедура бг_ОтложеннаяОбработкаОбъекта(ДокументСсылка, ВариантОбработки, Отказ,
	ДополнительныеСведения = Неопределено) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не бг_КонстантыПовтИсп.ЗначениеКонстанты("ПроводитьДокументыОтWMSОтложенно") Тогда
		Возврат;
	КонецЕсли;
	
	ВсеВарианты = Перечисления.бг_ВариантыОтложеннойОбработкиОбъектов;
	
	Если ВариантОбработки = ВсеВарианты.ОбработатьДокументыWMS Тогда
		ОтложеннаяОбработкаПроведение(ДокументСсылка);
	ИначеЕсли ВариантОбработки = ВсеВарианты.РассчитатьПоказателиРаботыОператоровWMS Тогда
		ОтложеннаяОбработкаРасчетПоказателейРаботыОператоровWMS(ДокументСсылка);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтложеннаяОбработкаПроведение(ДокументСсылка)
	
	Попытка
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.Заблокировать();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
			
		ШапкаОшибки = ОписаниеОшибки();
		
		ТелоОшибки = "";
		Для каждого СообщениеПользователю Из ПолучитьСообщенияПользователю(Истина) Цикл
			ТелоОшибки = ТелоОшибки + ?(ПустаяСтрока(ТелоОшибки), "", Символы.ПС) + СообщениеПользователю.Текст;
		КонецЦикла;
		
		ТекстОшибки = ШапкаОшибки + Символы.ПС + ТелоОшибки;
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура бг_ЗафиксироватьОшибкуОтложеннойОбработки(ДокументСсылка, ТекстОшибки) Экспорт

	РегистрыСведений.бг_ДокументыИнтеграцииСоСкладскимиСистемами.ОбновитьСтатусДокумента(
		ДокументСсылка,
		ТекущаяДатаСеанса(),
		Перечисления.бг_СтатусыДокументовИнтеграцииСоСкладскимиСистемами.ЗагруженБезОбработки,
		0,
		ТекстОшибки);

КонецПроцедуры

Процедура ОтложеннаяОбработкаРасчетПоказателейРаботыОператоровWMS(ДокументСсылка) Экспорт
	
	ДанныеДляРасчета = бг_WMS.НовыйДанныеДляРасчетаПоказателейРаботыОператоровWMS();
	ЗаполнитьДанныеДляРасчетаПоказателейРаботыОператоровWMS(ДанныеДляРасчета, ДокументСсылка);
	бг_WMS.СформироватьДвиженияПоказателейРаботыОператоровWMS(ДанныеДляРасчета);
	
КонецПроцедуры

#КонецОбласти // Конец ОтложеннаяОбработка

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасчетПоказателейРаботыОператоровWMS

Процедура ЗаполнитьДанныеДляРасчетаПоказателейРаботыОператоровWMS(ДанныеДляРасчета, ДокументСсылка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеДляРасчета.Организация = Документы.битОтражениеФактаПоПриходномуОрдеру.ОрганизацияДокумента(
		ДокументСсылка);
	ДанныеДляРасчета.ОрганизацияЕГАИС = Документы.битОтражениеФактаПоПриходномуОрдеру.ОрганизацияЕГАИСДокумента(
		ДокументСсылка);
	
	СтатусыМарокПоОперации = Перечисления.бг_СтатусыАкцизныхМарок.СтатусыПоОперации(
		Метаданные.Документы.битОтражениеФактаПоПриходномуОрдеру.Имя);
	
	ДанныеДляРасчета.СтатусыМарок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		СтатусыМарокПоОперации.СтатусОприходоватьНаСкладе);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДляРасчетаПоказателейРаботыОператоровWMS();
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ПоследнийИндекс = РезультатыЗапроса.ВГраница();
	
	ЗаполнитьЗначенияСвойств(
		ДанныеДляРасчета.ДанныеШапкиДокумента,
		РезультатыЗапроса[ПоследнийИндекс - 3].Выгрузить()[0]);
		
	Для каждого СтрокаТоварыРаспоряжения Из РезультатыЗапроса[ПоследнийИндекс - 2].Выгрузить() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеДляРасчета.ТоварыРаспоряжения.Добавить(), СтрокаТоварыРаспоряжения);
	КонецЦикла;
	
	Для каждого СтрокаТоварыДокумента Из РезультатыЗапроса[ПоследнийИндекс - 1].Выгрузить() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеДляРасчета.ТоварыДокумента.Добавить(), СтрокаТоварыДокумента);
	КонецЦикла;
	
	Для каждого СтрокаШтрихкодыДокумента Из РезультатыЗапроса[ПоследнийИндекс].Выгрузить() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеДляРасчета.ШтрихкодыДокумента.Добавить(), СтрокаШтрихкодыДокумента);
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаДляРасчетаПоказателейРаботыОператоровWMS()
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	битОтражениеФактаПоПриходномуОрдеру.Ссылка КАК Документ,
	|	битОтражениеФактаПоПриходномуОрдеру.Проведен КАК Проведен,
	|	битОтражениеФактаПоПриходномуОрдеру.Дата КАК Дата,
	|	битОтражениеФактаПоПриходномуОрдеру.ВремяВыполнения КАК ВремяВыполнения,
	|	битОтражениеФактаПоПриходномуОрдеру.ОператорТСД КАК ОператорТСД,
	|	ДокументПриходныйОрдерНаТовары.Распоряжение КАК Распоряжение,
	|	битОтражениеФактаПоПриходномуОрдеру.Склад.бг_ПунктРазгрузки КАК ПунктРазгрузки
	|ПОМЕСТИТЬ ШапкаИРаспоряжения
	|ИЗ
	|	Документ.битОтражениеФактаПоПриходномуОрдеру КАК битОтражениеФактаПоПриходномуОрдеру
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары КАК ДокументПриходныйОрдерНаТовары
	|		ПО битОтражениеФактаПоПриходномуОрдеру.ПриходныйОрдерНаТовары = ДокументПриходныйОрдерНаТовары.Ссылка
	|			И (битОтражениеФактаПоПриходномуОрдеру.Ссылка = &ДокументСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Распоряжение,
	|	ПриобретениеТоваровУслуг.бг_ПунктПогрузки.КаналПродаж КАК КаналПродаж,
	|	ПриобретениеТоваровУслуг.бг_ПунктПогрузки.Территория КАК Территория
	|ПОМЕСТИТЬ ДанныеРаспоряжения
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаИРаспоряжения КАК ШапкаИРаспоряжения
	|		ПО ПриобретениеТоваровУслуг.Ссылка = ШапкаИРаспоряжения.Распоряжение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтКлиента.Ссылка,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаИРаспоряжения КАК ШапкаИРаспоряжения
	|		ПО ВозвратТоваровОтКлиента.Ссылка = ШапкаИРаспоряжения.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШапкаИРаспоряжения.Документ КАК Документ,
	|	ШапкаИРаспоряжения.Проведен КАК Проведен,
	|	ШапкаИРаспоряжения.Дата КАК Дата,
	|	ШапкаИРаспоряжения.ВремяВыполнения КАК ВремяВыполнения,
	|	ШапкаИРаспоряжения.ОператорТСД КАК ОператорТСД,
	|	ШапкаИРаспоряжения.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ШапкаИРаспоряжения.Распоряжение КАК Распоряжение,
	|	ДанныеРаспоряжения.КаналПродаж КАК КаналПродаж,
	|	ДанныеРаспоряжения.Территория КАК Территория
	|ИЗ
	|	ШапкаИРаспоряжения КАК ШапкаИРаспоряжения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРаспоряжения КАК ДанныеРаспоряжения
	|		ПО ШапкаИРаспоряжения.Распоряжение = ДанныеРаспоряжения.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Серия КАК Серия,
	|	СУММА(ПриобретениеТоваровУслугТовары.Количество) КАК Количество,
	|	СУММА(ПриобретениеТоваровУслугТовары.СуммаСНДС) КАК Сумма
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаИРаспоряжения КАК ШапкаИРаспоряжения
	|		ПО ПриобретениеТоваровУслугТовары.Ссылка = ШапкаИРаспоряжения.Распоряжение
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Серия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтКлиентаТовары.Номенклатура,
	|	ВозвратТоваровОтКлиентаТовары.Серия,
	|	СУММА(ВозвратТоваровОтКлиентаТовары.Количество),
	|	ВозвратТоваровОтКлиентаТовары.СуммаСНДС
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаИРаспоряжения КАК ШапкаИРаспоряжения
	|		ПО ВозвратТоваровОтКлиентаТовары.Ссылка = ШапкаИРаспоряжения.Распоряжение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратТоваровОтКлиентаТовары.Номенклатура,
	|	ВозвратТоваровОтКлиентаТовары.Серия,
	|	ВозвратТоваровОтКлиентаТовары.СуммаСНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	битОтражениеФактаПоПриходномуОрдеруТовары.Номенклатура КАК Номенклатура,
	|	битОтражениеФактаПоПриходномуОрдеруТовары.Серия КАК Серия,
	|	битОтражениеФактаПоПриходномуОрдеруТовары.Количество КАК Количество
	|ИЗ
	|	Документ.битОтражениеФактаПоПриходномуОрдеру.Товары КАК битОтражениеФактаПоПриходномуОрдеруТовары
	|ГДЕ
	|	битОтражениеФактаПоПриходномуОрдеруТовары.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	битОтражениеФактаПоПриходномуОрдеруШтрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	Документ.битОтражениеФактаПоПриходномуОрдеру.Штрихкоды КАК битОтражениеФактаПоПриходномуОрдеруШтрихкоды
	|ГДЕ
	|	битОтражениеФактаПоПриходномуОрдеруШтрихкоды.Ссылка = &ДокументСсылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти // Конец РасчетПоказателейРаботыОператоровWMS

#КонецОбласти

#КонецЕсли
